In [1]:
import pandas as pd
import numpy as np

In [4]:
data = pd.read_csv('train.csv')[['Age','Pclass','Fare', 'Survived']]

In [6]:
data.head(3)

    Age  Pclass     Fare  Survived
0  22.0       3   7.2500         0
1  38.0       1  71.2833         1
2  26.0       3   7.9250         1

In [7]:
data.isnull().mean()*100

Age         19.86532
Pclass       0.00000
Fare         0.00000
Survived     0.00000
dtype: float64

In [10]:
x = data.drop(columns=['Survived'])
y = data['Survived']

In [16]:
y
x

      Age  Pclass     Fare
0    22.0       3   7.2500
1    38.0       1  71.2833
2    26.0       3   7.9250
3    35.0       1  53.1000
4    35.0       3   8.0500
..    ...     ...      ...
886  27.0       2  13.0000
887  19.0       1  30.0000
888   NaN       3  23.4500
889  26.0       1  30.0000
890  32.0       3   7.7500

[891 rows x 3 columns]

In [17]:
from sklearn.model_selection  import train_test_split

In [50]:
X_train, X_test, y_train, y_test = train_test_split(x,y,test_size=0.2, random_state=2)

In [51]:
X_train.head(2)

     Age  Pclass     Fare
30  40.0       1  27.7208
10   4.0       3  16.7000

In [20]:
from sklearn.impute import KNNImputer,SimpleImputer

In [21]:
knn = KNNImputer()

In [53]:
X_train_trf = knn.fit_transform(X_train)
X_test_trf = knn.transform(X_test)

In [54]:
pd.DataFrame(x_train_trf, columns=x_train.columns)

      Age  Pclass      Fare
0    40.0     1.0   27.7208
1     4.0     3.0   16.7000
2    47.0     3.0    9.0000
3     9.0     3.0   31.3875
4    20.0     3.0    9.8458
..    ...     ...       ...
707  30.0     3.0    8.6625
708  24.4     3.0    8.7125
709  71.0     1.0   49.5042
710  33.6     1.0  221.7792
711  42.8     1.0   25.9250

[712 rows x 3 columns]

In [60]:
knn = KNNImputer(n_neighbors=3,weights='distance')

X_train_trf = knn.fit_transform(X_train)
X_test_trf = knn.transform(X_test)

In [61]:
lr = LogisticRegression()

lr.fit(X_train_trf,y_train)

y_pred = lr.predict(X_test_trf)

accuracy_score(y_test,y_pred)

0.7150837988826816